<?php
/**
 * 该文件仅用于定义一些用到的常量,统一调用,后期维护更轻松
 * 注： 常量定义成数组的形式php5.6以下不能使用
 * Created by PhpStorm.
 * User: 万奇
 * Date: 2020/12/4 0004
 * Time: 15:03
 */

class StaticData {
    const RESOURCE_NAME = [
        // 客户来源
        'follow_add_way'    => [ 0 => '未知来源', 1 => '扫描二维码', 2 => '搜索手机号', 3 => '名片分享', 4 => '群聊', 5 => '手机通讯录', 6 => '微信联系人', 7 => '来自微信的添加好友申请', 8 => '安装第三方应用时自动添加的客服人员', 9 => '搜索邮箱', 201 => '内部成员共享', 202 => '管理员/负责人分配'],
       //文件大小
        'file_type_size'    => [ 'image' => 2048000 , 'voice' => 2048000 ,'video' => 10240000 ,'file' => 20480000 ],
        // 客户跟进状态
        'follow_status'     => [1 => '未跟进', 2 => '跟进中', 3 => '已拒绝', 4 => '已成交'],
        // 首页版本检测路径
        'license_url'       => 'http://a.huankemao.com/license/verify',
        // 内容类型
        'content_type_list' => [1 => '文本', 2 => '图片', 3 => '图文', 4 => '音频', 5 => '视频', 6 => '小程序', 7 => '文件', 8 =>'跳转链接'],
        // 性别
        'gender'            => [1 => '男性', 2 => '女性', 0 => '未知'],
        // 引流类型
        'drainage_type'     => [1 => '渠道活码', 2 => '红包拉新', 3 => '文章引流', 4 => '活动裂变', 5 => '抽奖助手', 6 => '邀请有奖', 7 => '其他渠道'],
        // 成员激活状态
        'staff_status'      => [1 => '已激活', 2 => '已禁用', 4 => '未激活', 5 => '退出企业'],
    ];

}